Documents/ПроизвольнаяОперацияПоСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПроизвольнаяОперацияПоСчетам</Name>
			<BasedOn>
				<xr:Item>Document.Доход</xr:Item>
				<xr:Item>Document.ПроизвольнаяОперацияПоСчетам</xr:Item>
				<xr:Item>Document.Расход</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаРасхода</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизвольнаяОперацияПоСчетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПроизвольнаяОперацияПоСчетам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует объект значениями по умолчанию
//
// Параметры:
//  Объект - ДокументОбъект.ПроизвольнаяОперацияПоСчетам, ДанныеФормыСтруктура -
Процедура ЗаполнитьНовыйОбъект(Объект) Экспорт
	Объект.Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ДобавитьКомандыСозданияНаОсновании(Команды, НастройкиФормы) Экспорт
	ДобавитьКомандуСозданияНаОсновании(Команды);
КонецПроцедуры

Функция ДобавитьКомандуСозданияНаОсновании(Команды) Экспорт
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(Команды,
		Метаданные.Документы.ПроизвольнаяОперацияПоСчетам);
	//
КонецФункции

// Добавляет команды отчетов для данного документа
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	Отчеты.ОстаткиНаСчетах.ДобавитьКомандуОтчета(КомандыОтчетов);
КонецПроцедуры

// Формирует наборы движений по регистрам для переданного документа
//
// Параметры:
//  Ссылка - ДокументСсылка.ПроизвольнаяОперацияПоСчетам -
//
// Возвращаемое значение:
//  Структура - Ключ структуры соответствует имени регистра.
//              Значение каждого свойства - ТаблицаЗначений с движениями по регистру
Функция ДанныеДляПроведенияДокумента(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизвольнаяОперацияПоСчетам.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ПроизвольнаяОперацияПоСчетам.СчетСписания КАК Счет,
		|	ПроизвольнаяОперацияПоСчетам.СуммаДокумента КАК Сумма,
		|	ПроизвольнаяОперацияПоСчетам.СчетСписания <> ЗНАЧЕНИЕ(Справочник.Счета.ПустаяСсылка)
		|		И ПроизвольнаяОперацияПоСчетам.СчетЗачисления <> ЗНАЧЕНИЕ(Справочник.Счета.ПустаяСсылка) КАК ЭтоПереводМеждуСчетами
		|ИЗ
		|	Документ.ПроизвольнаяОперацияПоСчетам КАК ПроизвольнаяОперацияПоСчетам
		|ГДЕ
		|	ПроизвольнаяОперацияПоСчетам.Ссылка = &Ссылка
		|	И ПроизвольнаяОперацияПоСчетам.СчетСписания <> ЗНАЧЕНИЕ(Справочник.Счета.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроизвольнаяОперацияПоСчетам.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ПроизвольнаяОперацияПоСчетам.СчетЗачисления,
		|	ПроизвольнаяОперацияПоСчетам.СуммаДокумента,
		|	ПроизвольнаяОперацияПоСчетам.СчетСписания <> ЗНАЧЕНИЕ(Справочник.Счета.ПустаяСсылка)
		|		И ПроизвольнаяОперацияПоСчетам.СчетЗачисления <> ЗНАЧЕНИЕ(Справочник.Счета.ПустаяСсылка)
		|ИЗ
		|	Документ.ПроизвольнаяОперацияПоСчетам КАК ПроизвольнаяОперацияПоСчетам
		|ГДЕ
		|	ПроизвольнаяОперацияПоСчетам.Ссылка = &Ссылка
		|	И ПроизвольнаяОперацияПоСчетам.СчетЗачисления <> ЗНАЧЕНИЕ(Справочник.Счета.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Новый Структура("ОстаткиНаСчетах", РезультатЗапроса.Выгрузить());
КонецФункции

#КонецОбласти

#КонецЕсли
